doom-config/.config/doom/config.org
#+TITLE: My Doom Emacs Literate Config
#+STARTUP: overview
#+OPTIONS: toc:nil


* Table Of Content :TOC_5_gh:
- [[#introduction][Introduction]]
  - [[#instalation][instalation]]
    - [[#emacs][emacs:]]
    - [[#todo-private-doom-config][TODO: Private Doom config]]
    - [[#doom][Doom:]]
- [[#initialization][Initialization]]
- [[#packages][Packages]]
- [[#configuration][configuration]]
  - [[#autoload-modules][autoload modules]]
    - [[#bufferel][buffer.el]]
    - [[#gitel][git.el]]
    - [[#miscel][misc.el]]
    - [[#osel][os.el]]
    - [[#progel][prog.el]]
    - [[#textel][text.el]]
    - [[#uiel][ui.el]]
  - [[#modules][modules]]
    - [[#lazycat][lazycat]]
      - [[#autoload][autoload]]
      - [[#configel][config.el]]
      - [[#packagesel][packages.el]]
    - [[#my-checker][my-checker]]
      - [[#autoload-1][autoload]]
      - [[#configel-1][config.el]]
      - [[#packagesel-1][packages.el]]
    - [[#nano-emacs][nano-emacs]]
      - [[#configel-2][config.el]]
      - [[#packagesel-2][packages.el]]
    - [[#my-python][my-python]]
      - [[#autoload-2][autoload]]
      - [[#configel-3][config.el]]
      - [[#packagesel-3][packages.el]]
  - [[#configel-4][config.el]]
    - [[#imprting-custom-config-files][imprting custom config files]]
    - [[#name-and-email][Name and email]]
    - [[#misc-config][misc config]]
  - [[#uiel-1][+ui.el]]
    - [[#setting-fonts][Setting fonts]]
    - [[#emacs-window-setup][Emacs Window Setup]]
    - [[#theme][Theme]]
    - [[#ui-config][UI config]]
  - [[#textel-1][+text.el]]
    - [[#text][text]]
    - [[#org][ORG]]
    - [[#markdown][MARKDOWN]]
    - [[#others][OTHERS]]
  - [[#progel-1][+prog.el]]
    - [[#misc][MISC]]
    - [[#cc][CC]]
    - [[#js-web][JS, WEB]]
    - [[#java][JAVA]]
    - [[#debug--run][DEBUG & RUN]]
    - [[#language-customization][LANGUAGE CUSTOMIZATION]]
  - [[#osel-1][+os.el]]
    - [[#macos][MACOS]]
    - [[#linux][LINUX]]
    - [[#trash][TRASH]]
  - [[#miscel-1][+misc.el]]
    - [[#use-chrome-to-browse][use chrome to browse]]
    - [[#spell-dict-file][Spell dict file]]
    - [[#screenshot][Screenshot]]
    - [[#centaur-tabs][Centaur-tabs]]
    - [[#input-method][INPUT METHOD]]
    - [[#log][LOG]]
    - [[#ssh][SSH]]
    - [[#navigation][NAVIGATION]]
    - [[#tmux][TMUX]]
    - [[#imenu-list][imenu-list]]
    - [[#better-jumper-post-jump-hook][better-jumper-post-jump-hook]]
    - [[#nav-flash][nav-flash]]
    - [[#dired][dired]]
    - [[#ranger][ranger]]
    - [[#dash-docs][dash-docs]]
    - [[#citre][CITRE]]
    - [[#translate][TRANSLATE]]
    - [[#quickrun][QUICKRUN]]
    - [[#projectile][PROJECTILE]]
    - [[#completion][COMPLETION]]
    - [[#atomic-chrome][ATOMIC CHROME]]
    - [[#prodigy][PRODIGY]]
    - [[#term][TERM]]
  - [[#lspel][+lsp.el]]
    - [[#clangd][clangd]]
    - [[#typescript][TypeScript]]
    - [[#java-1][Java]]
    - [[#lsp-mode--lsp-ui][lsp-mode & lsp-ui]]
    - [[#lsp-docker][lsp-docker]]
  - [[#eglotel][+eglot.el]]
- [[#modes-config][Modes Config]]
  - [[#python-setup][Python Setup]]
  - [[#web-mode-setup][Web-mode Setup]]
- [[#plugins-custom-configs][Plugins Custom Configs]]
  - [[#evil-snipe][evil-snipe]]
- [[#git][GIT]]
- [[#bindings][Bindings]]

* Introduction
This is my Private Literate config for doom-emacs.
My config was growing with time So i Moved it to a literate type of config in hopes of keeping it organized.
** instalation
*** emacs:
We first gotta make sure emacs is installed and properly:
First:
#+begin_src sh :tangle no
mkcd ~/Build/Emacs

git clone https://git.savannah.gnu.org/git/emacs.git master
#+end_src

We then should use the amazing git worktree, to insure not to contaminate the
master branch:
#+begin_src sh :tangle no
git worktree add ../my-custom-build (choose name you prefer)

cd ../my-custom-build
#+end_src

Afterwards We could Start the build process:
#+begin_src sh :tangle no
./autogen.sh

#+end_src
And Then Run the Config script with the desired flags:
#+begin_src
./configure --with-cairo --with-x-toolkit=lucid --with-tree-sitter --without-compress-install --with-harfbuzz --with-json --without-gsettings --without-gconf--with-mailutils --with-native-compilation=aot --with-imagemagick --program-transform-name='s/^ctags$/ctags.emacs/' --with-modules CFLAGS="-O3 -march=native -flto"
#+end_src

Then start the build Process itself:
#+begin_src sh :tangle no
make -jN (N = number of cores you have in your cpu)
#+end_src

Now we're free to install locally:
#+begin_src sh :tangle no
sudo make install
#+end_src

*** TODO: Private Doom config
#+begin_src sh :tangle no

#+end_src

*** Doom:
To install, we have to first clone doom emacs base config:
#+begin_src sh :tangle no
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.config/emacs
~/.config/emacs/bin/doom install
#+end_src

