doom-config/.config/doom/config.org
* Initialization
this the first thing to be processed by doom emacs.
#+begin_src emacs-lisp :tangle init.el

;;; init.el -*- lexical-binding: t; -*-


(doom! :input
       ;;bidi                          ; (tfel ot) thgir etirw uoy gnipleh
       ;;chinese
       ;;japanese
       ;;layout                        ; auie,ctsrnm is the superior home row

       :completion
       ( company +childframe)          ; the ultimate code completion backend
       ;;(helm              ; the *other* search engine for love and life
       ;;+fuzzy)            ; enable fuzzy search backend for helm
       ;;ido                ; the other *other* search engine...
       ;; (ivy               ; a search engine for love and life
       ;;  +icons
       ;;  +prescient       ; disabled due to ! invert match not working
       ;;  +childframe)
       (vertico           ; the search engine of the future
        +icons)

       :ui
       ;;deft                          ; notational velocity for Emacs
       doom                            ; what makes DOOM look the way it does
       doom-dashboard                  ; a nifty splash screen for Emacs
       ;;doom-quit                     ; DOOM quit-message prompts when you quit Emacs
       (emoji +ascii +github +unicode) ; 🙂
       hl-todo                         ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       hydra
       indent-guides                   ; highlighted indent columns
       ligatures                       ; ligatures and symbols to make your code pretty again
       ;;minimap                       ; show a map of the code on the side
       modeline                        ; snazzy, Atom-inspired modeline, plus API
       nav-flash                       ; blink cursor line after big motions
       ;                               ; neotree           ; a project drawer, like NERDTree for vim
       ophints                         ; highlight the region an operation acts on
       (popup +all +defaults)          ; tame sudden yet inevitable temporary windows
       tabs                            ; a tab bar for Emacs
       ( treemacs +lsp)                ; a project drawer, like neotree but cooler
       unicode                         ; extended unicode support for various languages
       (vc-gutter +pretty)             ; vcs diff in the fringe
       vi-tilde-fringe                 ; fringe tildes to mark beyond EOB
       ;;window-select                 ; visually switch windows
       workspaces                      ; tab emulation, persistence & separate workspaces
       zen                             ; distraction-free coding or writing

       :editor
       (evil +everywhere)              ; come to the dark side, we have cookies
       file-templates                  ; auto-snippets for empty files
       fold                            ; (nigh) universal code folding
       (format +onsave)                ; automated prettiness
       ;;god                           ; run Emacs commands without modifier keys
       ;;lispy                         ; vim for lisp, for people who don't like vim
       multiple-cursors                ; editing in many places at once
       ;;objed                         ; text object editing for the innocent
       ;;parinfer                      ; turn lisp into python, sort of
       ;;rotate-text                   ; cycle region at point between text candidates
       snippets                        ; my elves. They type so I don't have to
       ;;word-wrap                     ; soft wrapping with language-aware indent

       :emacs
       (dired                          ; making dired pretty [functional]
        +ranger                        ; bringing the goodness of ranger to dired
        +icons)                        ; colorful icons for dired-mode
       electric                        ; smarter, keyword-based electric-indent
       ibuffer                         ; interactive buffer management
       undo                            ; persistent, smarter undo for your inevitable mistakes
       vc                              ; version-control and Emacs, sitting in a tree

       :term
       eshell                          ; the elisp shell that works everywhere
       ;;shell                         ; simple shell REPL for Emacs
       ;;term                          ; basic terminal emulator for Emacs
       vterm                           ; the best terminal emulation in Emacs

       :checkers
       (syntax
        +childframe
        )                              ; tasing you for every semicolon you forget
       ;; (spell +aspell)                 ; tasing you for misspelling mispelling
       grammar                         ; tasing grammar mistake every you make

       :tools
       ;;ansible
       ;;biblio                        ; Writes a PhD for you (citation needed)
       ;;collab                        ; buffers with friends
       ( debugger +lsp)                ; FIXME stepping through code, to help you add bugs
       direnv
       docker
       editorconfig                    ; let someone else argue about tabs vs spaces
       ;;ein                           ; tame Jupyter notebooks with emacs
       (eval +overlay)                 ; run code, run (also, repls)
       ;;gist                          ; interacting with github gists
       (lookup                         ; navigate your code and its documentation
        +dictionary                    ; enable word definition and thesaurus lookup functionality
        +devdocs                       ; ...on devdocs.io online
        +docsets)                      ; ...or in Dash docsets locally
       ( lsp +peek)                    ; M-x vscode
       magit                           ; a git porcelain for Emacs
       make                            ; run make tasks from Emacs
       ;;pass                          ; password manager for nerds
       pdf                             ; pdf enhancements
       prodigy                         ; FIXME managing external services & code builders
       rgb                             ; creating color strings
       taskrunner                      ; taskrunner for all your projects
       terraform                       ; infrastructure as code
       ;;tmux                          ; an API for interacting with tmux
       tree-sitter                     ; syntax and parsing, sitting in a tree...
       ;;upload                        ; map local to remote projects via ssh/ftp

       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       (tty +osc)                      ; improve the terminal Emacs experience

       :lang
       ;;agda                          ; types of types of types of types...
       ;;beancount                     ; mind the GAAP
       (cc +lsp +tree-sitter)          ; C > C++ == 1
       ;;clojure                       ; java with a lisp
       ;;common-lisp                   ; if you've seen one lisp, you've seen them all
       ;;coq                           ; proofs-as-programs
       ;;crystal                       ; ruby at the speed of c
       ;;csharp                        ; unity, .NET, and mono shenanigans
       data                            ; config/data formats
       ;;(dart +flutter)               ; paint ui and not much else
       ;;dhall
       ;;elixir                        ; erlang done right
       ;;elm                           ; care for a cup of TEA?
       emacs-lisp                      ; drown in parentheses
       ;;erlang                        ; an elegant language for a more civilized age
       ;;ess                           ; emacs speaks statistics
       ;;factor
       ;;faust                         ; dsp, but you get to keep your soul
       ;;fortran                       ; in FORTRAN, GOD is REAL (unless declared INTEGER)
       ;;fsharp                        ; ML stands for Microsoft's Language
       ;;fstar                         ; (dependent) types and (monadic) effects and Z3
       ;;gdscript                      ; the language you waited for
       (go +lsp +tree-sitter)          ; the hipster dialect
       ;;(graphql +lsp)                ; Give queries a REST
       ;;(haskell +lsp)                ; a language that's lazier than I am
       ;;hy                            ; readability of scheme w/ speed of python
       ;;idris                         ; a language you can depend on
       (json +lsp +tree-sitter)        ; At least it ain't XML
       ;;(java +lsp)                   ; the poster child for carpal tunnel syndrome
       (javascript +lsp +tree-sitter)  ; all(hope(abandon(ye(who(enter(here))))))
       ;;julia                         ; a better, faster MATLAB
       ;;kotlin                        ; a better, slicker Java(Script)
       ;;latex                         ; writing papers in Emacs has never been so fun
       ;;lean                          ; for folks with too much to prove
       ;;ledger                        ; be audit you can be
       ( lua +lsp +tree-sitter)        ; one-based indices? one-based indices
       (markdown +grip)                ; writing docs for people to ignore
       ;;nim                           ; python + lisp at the speed of c
       ;;nix                           ; I hereby declare "nix geht mehr!"
       ;;ocaml                         ; an objective camel
       (org                            ; organize your plain life in plain text
        ;                              ; +pretty
        +dragndrop                     ; drag & drop files/images into org buffers
        +pandoc                        ; export-with-pandoc support
        +present)                      ; using org-mode for presentations
       ;;php                           ; perl's insecure younger brother
       ;;plantuml                      ; diagrams for confusing people more
       ;;purescript                    ; javascript, but functional
       (python
        ;; +pyenv
        +conda
        +poetry
        +pyright
        +lsp
        +tree-sitter)                  ; beautiful is better than ugly
       ;;qt                            ; the 'cutest' gui framework ever
       ;;racket                        ; a DSL for DSLs
       ;;raku                          ; the artist formerly known as perl6
       ;;rest                          ; Emacs as a REST client
       ;;rst                           ; ReST in peace
       ;;(ruby +rails)                 ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       (rust +lsp +tree-sitter)        ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       ;;scala                         ; java, but good
       ;;(scheme +guile)               ; a fully conniving family of lisps
       (sh +lsp +tree-sitter)          ; she sells {ba,z,fi}sh shells on the C xor
       ;;sml
       ;;solidity                      ; do you need a blockchain? No.
       ;;swift                         ; who asked for emoji variables?
       ;;terra                         ; Earth and Moon in alignment for performance.
       ( web +lsp +tree-sitter)        ; the tubes
       (yaml +lsp +tree-sitter)        ; JSON, but readable
       (zig +lsp +tree-sitter)         ; C, but simpler

       :email
       ;;(mu4e +org +gmail)
       ;;notmuch
       ;;(wanderlust +gmail)

       :app
       ;;calendar
       ;;emms
       ;;everywhere                    ; *leave* Emacs!? You must be joking
       ;;irc                           ; how neckbeards socialize
       ;;(rss +org)                    ; emacs as an RSS reader
       ;;twitter                       ; twitter client https://twitter.com/vnought

       :config
       ;;literate
       (default +bindings +smartparens +snippets)


       :private
       ;; lazycat          ; snails, color-rg, fuz
       my-python
       my-checker
       ;; nano-theme
       )

(setq custom-file (expand-file-name "custom.el" doom-local-dir))
(load custom-file 'no-error 'no-message)

#+end_src

* Packages
in this part, we disable packages that are added by doom
#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; private/my/packages.el

;; disabled packages
(disable-packages! solaire-mode
                   osx-trash
                   realgud
                   realgud-trepan-ni
                   ccls
                   tide
                   swiper
                   forge
                   code-review
                   anaconda-mode
                   company-anaconda
                   lsp-python-ms
                   pyimport)
#+end_src

and Here we add the packages want installed
#+begin_src emacs-lisp :tangle packages.el
;; text
(package! adoc-mode)
(package! tldr)
(package! edit-indirect)
(package! blog-admin :recipe (:host github :repo "codefalling/blog-admin"))
;; (package! youdao-dictionary)
(package! link-hint)
(package! symbol-overlay)
(package! pomm)
(package! org-appear)

;; misc
(package! format-all)
(package! keycast)
(package! evil-string-inflection)
(package! all-the-icons-ibuffer)
(package! dired-narrow)
(package! atomic-chrome)
(package! git-link)
(package! magit-delta)
(package! citre)
(package! imenu-list)
;; (package! tmux-pane)
(package! rime :recipe (:host github :repo "DogLooksGood/emacs-rime" :files ("*.el" "Makefile" "lib.c")))
(package! go-translate)
;; (package! org-roam-ui)
;; (package! md-roam :recipe (:host github :repo "nobiot/md-roam"))

;; programming
(package! bazel-mode :recipe (:host github :repo "bazelbuild/emacs-bazel-mode"))
(package! graphql-mode)
(package! protobuf-mode)
(package! gn-mode)
(when (modulep! :tools lsp +eglot)
  (package! breadcrumb :recipe (:host github :repo "joaotavora/breadcrumb"))
  (package! eglot-java)
  )
(when (not (modulep! :tools lsp +eglot))
  (package! lsp-docker))

#+end_src

* configuration
** autoload modules
