doom-config/.config/doom/config.org
*** os.el
#+begin_src emacs-lisp :tangle autoload/os.el :mkdirp yes
;;; ~/.doom.d/autoload/os.el -*- lexical-binding: t; -*-

;; Copied from https://github.com/emacsorphanage/osx-trash/blob/master/osx-trash.el
(defconst os--trash-pkg-file
  (expand-file-name (if load-in-progress load-file-name (buffer-file-name)))
  "The absolute path to this file.")

(defconst os--trash-pkg-dir
  (file-name-directory os--trash-pkg-file)
  "The absolute path to the directory of this package.")

(defun os--trash-move-file-to-trash (file-name)
  "Move FILE-NAME to trash.

Try to call the `trash' utility first"
  (let ((file-name (expand-file-name file-name)))
    (with-temp-buffer
      (let ((retcode (call-process "trash" nil t nil file-name)))
        (unless (equal retcode 0)
          (error "Failed to trash %S: %S" file-name (buffer-string)))))))

;;;###autoload
(defun os--trash-setup ()
  "Provide trash support for OS X.

Provide `system-move-file-to-trash' as an alias for
`os--trash-move-file-to-trash'.

Note that you still need to set `delete-by-moving-to-trash' to a
non-nil value to enable trashing for file operations."
  (when (not (fboundp 'system-move-file-to-trash))
    (defalias 'system-move-file-to-trash
      'os--trash-move-file-to-trash)))

;;;###autoload
(defun +macos-open-with (&optional app-name path)
  "Send PATH to APP-NAME on OSX."
  (interactive)
  (let* ((path (expand-file-name
                (replace-regexp-in-string
                 "'" "\\'"
                 (or path (if (derived-mode-p 'dired-mode)
                              (dired-get-file-for-visit)
                            (buffer-file-name)))
                 nil t)))
         (command (format "open %s"
                          (if app-name
                              (format "-a %s '%s'" (shell-quote-argument app-name) path)
                            (format "'%s'" path)))))
    (message "Running: %s" command)
    (shell-command command)))

;;;###autoload
(defmacro +macos--open-with (id &optional app dir)
  `(defun ,(intern (format "+macos/%s" id)) ()
     (interactive)
     (+macos-open-with ,app ,dir)))

;;;###autoload
(defun +shell-open-with (&optional app-name args container app-window-name)
  "Open shell application."
  (interactive)
  (let* ((process-connection-type nil))
    (if (string= "" app-window-name) (setq app-window-name app-name))
    (if container
        (setq command (format "docker exec --user user %s %s %s" container app-name args))
      (setq command (format "%s %s" app-name args)))
    (async-shell-command-no-window command)
    (message command)
    (when IS-LINUX
      (shell-command (concat "wmctrl -a \"" app-window-name "\" ")))))

;;;###autoload
(defun notify-current-line-number ()
  (alert (concat "line number " (number-to-string (line-number-at-pos))) :severity 'low))

;;;###autoload
(defmacro +shell--open-with (id &optional app args)
  `(defun ,(intern (format "+shell/%s" id)) ()
     (interactive)
     (+shell-open-with ,app ,args)
     (notify-current-line-number)))

;;;###autoload
(defmacro +docker--open-with (id &optional app args container app-window-name)
  `(defun ,(intern (format "+docker/%s" id)) ()
     (interactive)
     (+shell-open-with ,app ,args ,container ,app-window-name)
     (notify-current-line-number)))

;;;###autoload
(when IS-MAC
  (defvar alacritty-bin "/Applications/Alacritty.app/Contents/MacOS/alacritty"
    "Alacritty terminal binary localtion.")
  (defvar iterm-bin "/Applications/iTerm.app/Contents/MacOS/iTerm2"
    "iTerm2 terminal binary localtion.")

  (defun +macos/reveal-in-terminal ()
    (interactive)
    (cond
     ((executable-find alacritty-bin)
      (+shell-open-with alacritty-bin (concat "--working-directory='" default-directory"'")))
     ((executable-find iterm-bin)
      (iterm-open-new-tab default-directory))))
  (defun +macos/reveal-project-in-terminal ()
    (interactive)
    (cond
     ((executable-find alacritty-bin)
      (+shell-open-with alacritty-bin (concat "--working-directory='" (or (doom-project-root) default-directory)"'")))
     ((executable-find iterm-bin)
      (iterm-open-new-tab (or (doom-project-root) default-directory))))))

#+end_src

*** prog.el
#+begin_src emacs-lisp :tangle autoload/prog.el :mkdirp yes
;;; ~/.doom.d/autoload/prog.el -*- lexical-binding: t; -*-

(defun my/realgud-eval-nth-name-forward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (< (point) (point-max)))
        (let ((p (point)))
          (if (not (c-forward-name))
              (progn
                (c-forward-token-2)
                (when (= (point) p) (forward-char 1)))
            (setq name (buffer-substring-no-properties p (point)))
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)
        nil))))

(defun my/realgud-eval-nth-name-backward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (> (point) (point-min)))
        (let ((p (point)))
          (c-backward-token-2)
          (when (= (point) p) (backward-char 1))
          (setq p (point))
          (when (c-forward-name)
            (setq name (buffer-substring-no-properties p (point)))
            (goto-char p)
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)
        nil))))

(defun my/realgud-eval-region-or-word-at-point ()
  (interactive)
  (when-let*
      ((cmdbuf (realgud-get-cmdbuf))
       (process (get-buffer-process cmdbuf))
       (expr
        (if (evil-visual-state-p)
            (let ((range (evil-visual-range)))
              (buffer-substring-no-properties (evil-range-beginning range)
                                              (evil-range-end range)))
          (word-at-point)
          )))
    (with-current-buffer cmdbuf
      (setq realgud:process-filter-save (process-filter process))
      (set-process-filter process 'realgud:eval-process-output))
    (realgud:cmd-eval expr)
    ))

(defun +my//realtime-elisp-doc-function ()
  (-when-let* ((w (selected-window))
               (s (intern-soft (current-word))))
    (describe-symbol s)
    (select-window w)))

;;;###autoload
(defun +my/realtime-elisp-doc ()
  (interactive)
  (when (eq major-mode 'emacs-lisp-mode)
    (if (advice-function-member-p #'+my//realtime-elisp-doc-function eldoc-documentation-function)
        (remove-function (local 'eldoc-documentation-function) #'+my//realtime-elisp-doc-function)
      (add-function :after-while (local 'eldoc-documentation-function) #'+my//realtime-elisp-doc-function))))

;;;###autoload
(defun +my/realgud-eval-nth-name-forward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (< (point) (point-max)))
        (let ((p (point)))
          (if (not (c-forward-name))
              (progn
                (c-forward-token-2)
                (when (= (point) p) (forward-char 1)))
            (setq name (buffer-substring-no-properties p (point)))
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)))))

;;;###autoload
(defun +my/realgud-eval-nth-name-backward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (> (point) (point-min)))
        (let ((p (point)))
          (c-backward-token-2)
          (when (= (point) p) (backward-char 1))
          (setq p (point))
          (when (c-forward-name)
            (setq name (buffer-substring-no-properties p (point)))
            (goto-char p)
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)))))

;;;###autoload
(defun async-shell-command-no-window (command)
  "Requisite Documentation"
  (interactive)
  (let
      ((display-buffer-alist
        (list
         (cons
          "\\*Async Shell Command\\*.*"
          (cons #'display-buffer-no-window nil)))))
    (async-shell-command
     command nil nil)))

;;;###autoload
(defadvice async-shell-command-no-window (around auto-confirm compile activate)
  (cl-letf (((symbol-function 'yes-or-no-p) (lambda (&rest args) t))
            ((symbol-function 'y-or-n-p) (lambda (&rest args) t)))
    ad-do-it))

;;;###autoload
(defun display-which-function ()
  (interactive)
  (message (which-function)))

#+end_src

*** text.el
#+begin_src emacs-lisp :tangle autoload/text.el :mkdirp yes
;;; autoload/text.el -*- lexical-binding: t; -*-

(defun +my/markdown-highlight ()
  "Surround each line of the current REGION with a start/end tag."
  (interactive)
  (let ((delim "=="))
    (markdown--insert-common delim delim markdown-regex-bold 2 4 'markdown-bold-face t)))

;;;###autoload
(defun +my/markdown-highlight-using-html-mark ()
  "Surround each line of the current REGION with a start/end tag."
  (interactive)
  (require 'web-mode)
  (when mark-active
    (let (beg end line-beg line-end pos tag tag-start tag-end)
      (save-excursion
        (combine-after-change-calls
          (setq tag "mark"
                tag-start (concat "<" tag ">")
                tag-end (concat "</" tag ">")
                pos (point)
                beg (region-beginning)
                end (region-end)
                line-beg (web-mode-line-number beg)
                line-end (web-mode-line-number end))
          (goto-char end)
          (unless (bolp)
            (insert tag-end)
            (back-to-indentation)
            (when (> beg (point))
              (goto-char beg))
            (insert tag-start))
          (while (> line-end line-beg)
            (forward-line -1)
            (setq line-end (1- line-end))
            (unless (looking-at-p "[[:space:]]*$")
              (end-of-line)
              (insert tag-end)
              (back-to-indentation)
              (when (> beg (point))
                (goto-char beg))
              (insert tag-start))
            )                           ;while
          (deactivate-mark)
          )                             ;combine-after-change-calls
        )                               ;save-excursion
      )))

#+end_src

*** ui.el
#+begin_src emacs-lisp :tangle autoload/ui.el :mkdirp yes
;;; autoload/ui.el -*- lexical-binding: t; -*-

;;;###autoload
(defun toggle-display-line-numbers-type ()
  (interactive)
  (if display-line-numbers-type
      (setq display-line-numbers-type nil)
    (setq display-line-numbers-type t))
  (revert-buffer-no-confirm))

#+end_src

** modules
*** lazycat
**** autoload
#+begin_src emacs-lisp :tangle modules/private/lazycat/autoload/lazycat.el :mkdirp yes
;;; private/lazycat/autoload/lazycat.el -*- lexical-binding: t; -*-

;;;###autoload
(defun +my/search-project ()
  (interactive)
  (if current-prefix-arg
      (color-rg-search-project)
    (+default/search-project)))

#+end_src

**** config.el
#+begin_src emacs-lisp :tangle modules/private/lazycat/config.el :mkdirp yes
;;; private/lazycat/config.el -*- lexical-binding: t; -*-

(map! :leader
      :desc "Snails" :nmv "RET" #'snails
      (:prefix "s"
       :desc "Search project" "p" #'+my/search-project
       :desc "Search project customly" "P" #'color-rg-customized-search))

(set-popup-rules! '(("^\\*color-rg\\*$" :size 0.35)))

(use-package! color-rg
  :defer t
  :custom (color-rg-mac-load-path-from-shell nil)
  :commands color-rg-search-project
  :config
  ;; https://emacs.stackexchange.com/a/10588/22102
  (evil-make-overriding-map color-rg-mode-map 'normal)
  ;; force update evil keymaps after git-timemachine-mode loaded
  (add-hook 'color-rg-mode-hook #'evil-normalize-keymaps)

  (map! (:map color-rg-mode-map
         "j" nil "k" nil "l" nil "h" nil
         "C-k" #'color-rg-jump-prev-keyword
         "C-j" #'color-rg-jump-next-keyword
         :nv "gr" #'color-rg-rerun)
        (:map color-rg-mode-edit-map
         "C-c C-k" #'color-rg-quit))

  (custom-set-faces!
    `(color-rg-font-lock-match :foreground ,(doom-color 'red))
    `(color-rg-font-lock-header-line-text :foreground ,(doom-color 'dark-cyan))
    `(color-rg-font-lock-function-location :foreground ,(doom-color 'magenta))
    `(color-rg-font-lock-header-line-keyword :foreground ,(doom-color 'magenta))
    `(color-rg-font-lock-header-line-edit-mode :foreground ,(doom-color 'magenta))))


(when (display-graphic-p)
  (use-package! snails
    :defer t
    :custom (snails-use-exec-path-from-shell nil)
    :load-path  "~/.config/emacs/.local/straight/repos/snails"
    :commands snails
    :config
    (setq snails-input-buffer-text-scale 1)
    (set-evil-initial-state!
      '(snails-mode)
      'insert)
    (map!
     (:map snails-mode-map
      :nvi "C-g" #'snails-quit
      :nvi "ESC ESC ESC" #'snail-quit
      :nvi "C-n" #'snails-select-next-item
      :nvi "C-p" #'snails-select-prev-item
      :nvi "C-v" #'snails-select-next-backend
      :nvi "M-v" #'snails-select-prev-backend
      :nvi "RET" #'snails-candidate-do
      :nvi "C-RET" #'snails-candiate-alternate-do))
    )

  (use-package! fuz
    :defer t
    :config
    (unless (require 'fuz-core nil t)
      (fuz-build-and-load-dymod))))

#+end_src

**** packages.el
#+begin_src emacs-lisp :tangle modules/private/lazycat/packages.el :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; private/lazycat/packages.el

(package! color-rg :recipe (:host github :repo "manateelazycat/color-rg"))
(package! snails :recipe (:host github :repo "manateelazycat/snails"))
(package! fuz :recipe (:host github :repo "rustify-emacs/fuz.el"))

#+end_src

*** my-checker
**** autoload
#+begin_src emacs-lisp :tangle modules/private/my-checker/autoload/checker.el :mkdirp yes
;;; private/my-checker/autoload/checker.el -*- lexical-binding: t; -*-

;;;###autoload
(defun reset-flycheck (&rest _)
  (flycheck-mode -1)
  (flycheck-mode +1))

;;;###autoload
(defun occur-non-ascii ()
  "Find any non-ascii characters in the current buffer."
  (interactive)
  (occur "[^[:ascii:]]"))

;;add count for chinese, mainly used for writing chinese blog post
;; http://kuanyui.github.io/2014/01/18/count-chinese-japanese-and-english-words-in-emacs/
(defvar wc-regexp-english-word
  "[a-zA-Z0-9-]+")


#+end_src

